# Session 3b
Rabbani Mozahid, Hernando Vera
<br>
<br>

# Pandas

*pandas* is a Python library for data analysis. It offers a number of data exploration, cleaning and transformation operations that are critical in working with data in Python. 

*pandas* build upon *numpy* and *scipy* providing easy-to-use data structures and data manipulation functions with integrated indexing.

The main data structures *pandas* provides are *Series* and *DataFrames*. After a brief introduction to these two data structures and data ingestion, the key features of *pandas* this notebook covers are:
* Generating descriptive statistics on data
* Data cleaning using built in pandas functions
* Frequent data operations for subsetting, filtering, insertion, deletion and aggregation of data
* Merging multiple datasets using dataframes
* Working with timestamps and time-series data

**Additional Recommended Resources:**
* *pandas* Documentation: http://pandas.pydata.org/pandas-docs/stable/
* *Python for Data Analysis* by Wes McKinney
* *Python Data Science Handbook* by Jake VanderPlas

Let's get started with our first *pandas* notebook!

<p style="font-family: Arial; font-size:1.75em;color:#2462C0; font-style:bold"><br>

Import Libraries
</p>

In [24]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from matplotlib.pyplot import pie, axis, show
from IPython.display import Markdown, display
from plotly.offline import init_notebook_mode, iplot

<p style="font-family: Arial; font-size:1.75em;color:#2462C0; font-style:bold">
Introduction to pandas Data Structures</p>
<br>
*pandas* has two main data structures it uses, namely, *Series* and *DataFrames*. 

<p style="font-family: Arial; font-size:1.75em;color:#2462C0; font-style:bold">
pandas Series</p>

### *pandas Series* one-dimensional labeled array.

In [25]:
# pandas Series - one-dimensional labeled array
ser1=pd.Series([95, 'forty', 30, 'sixty', 75], 
['bob', 'rose', 'sue', 'tom', 'eve'])
ser1

bob        95
rose    forty
sue        30
tom     sixty
eve        75
dtype: object

ser1.index

In [26]:
ser1.loc[['sue','tom']]

sue       30
tom    sixty
dtype: object

In [27]:
ser1[[4, 3, 1]]

eve        75
tom     sixty
rose    forty
dtype: object

In [28]:
ser1.iloc[2]

30

In [29]:
'bob' in ser1

True

In [30]:
ser1 * 2

bob            190
rose    fortyforty
sue             60
tom     sixtysixty
eve            150
dtype: object

In [31]:
ser1[['bob', 'sue']] ** 2

bob    9025
sue     900
dtype: object


### *pandas DataFrame* is a 2-dimensional labeled data structure.

<p style="font-family: Arial; font-size:1.25em;color:#2462C0; font-style:bold">
Create DataFrame from dictionary of Python Series</p>

In [32]:
ser1=pd.Series([1, 2, 3], index=['a', 'b', 'c'])
ser2=pd.Series([2, 4, 6, 7], index=['a', 'b', 'c', 'd'])
print (ser1)
print (ser2)

a    1
b    2
c    3
dtype: int64
a    2
b    4
c    6
d    7
dtype: int64

In [33]:
d = {'one' : ser1,
     'two' : ser2}
df = pd.DataFrame(d)
print(df)

   one  two
a  1.0    2
b  2.0    4
c  3.0    6
d  NaN    7

In [34]:
df.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [35]:
df.columns

Index(['one', 'two'], dtype='object')

In [36]:
d

{'one': a    1
 b    2
 c    3
 dtype: int64,
 'two': a    2
 b    4
 c    6
 d    7
 dtype: int64}

In [37]:
# Creating a dataframe with selected indexes
pd.DataFrame(d, index=[ 'b', 'c'])

   one  two
b    2    4
c    3    6

In [38]:
pd.DataFrame(d, index=['d', 'b', 'a'], columns=['two', 'three'])

   two three
d    7   NaN
b    4   NaN
a    2   NaN

<p style="font-family: Arial; font-size:1.25em;color:#2462C0; font-style:bold">
Create DataFrame from list of Python dictionaries</p>

In [39]:
data = [{'alex': 1, 'joe': 2}, {'ema': 5, 'dora': 10, 'alice': 20}]

In [40]:
df1=pd.DataFrame(data)

In [41]:
df1

   alex  joe  ema  dora  alice
0   1.0  2.0  NaN   NaN    NaN
1   NaN  NaN  5.0  10.0   20.0

### Reading from Clipbpard

1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.25,,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.925,,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1,C123,S
5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.05,,S
6,0,3,"Moran, Mr. James",male,,0,0,330877,8.4583,,Q
7,0,1,"McCarthy, Mr. Timothy J",male,54,0,0,17463,51.8625,E46,S
8,0,3,"Palsson, Master. Gosta Leonard",male,2,3,1,349909,21.075,,S
9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27,0,2,347742,11.1333,,S
10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14,1,0,237736,30.0708,,C
11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4,1,1,PP 9549,16.7,G6,S
12,1,1,"Bonnell, Miss. Elizabeth",female,58,0,0,113783,26.55,C103,S
13,0,3,"Saundercock, Mr. William Henry",male,20,0,0,A/5. 2151,8.05,,S
14,0,3,"Andersson, Mr. Anders Johan",male,39,1,5,347082,31.275,,S
15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,14,0,0,350406,7.8542,,S
16,1,2,"Hewlett, Mrs. (Mary D Kingcome) ",female,55,0,0,248706,16,,S
17,0,3,"Rice, Master. Eugene",male,2,4,1,382652,29.125,,Q
18,1,2,"Williams, Mr. Charles Eugene",male,,0,0,244373,13,,S
19,0,3,"Vander Planke, Mrs. Julius (Emelia Maria Vandemoortele)",female,31,1,0,345763,18,,S
20,1,3,"Masselmani, Mrs. Fatima",female,,0,0,2649,7.225,,C
21,0,2,"Fynney, Mr. Joseph J",male,35,0,0,239865,26,,S
22,1,2,"Beesley, Mr. Lawrence",male,34,0,0,248698,13,D56,S
23,1,3,"McGowan, Miss. Anna ""Annie""",female,15,0,0,330923,8.0292,,Q
24,1,1,"Sloper, Mr. William Thompson",male,28,0,0,113788,35.5,A6,S
25,0,3,"Palsson, Miss. Torborg Danira",female,8,3,1,349909,21.075,,S
26,1,3,"Asplund, Mrs. Carl Oscar (Selma Augusta Emilia Johansson)",female,38,1,5,347077,31.3875,,S
27,0,3,"Emir, Mr. Farred Chehab",male,,0,0,2631,7.225,,C
28,0,1,"Fortune, Mr. Charles Alexander",male,19,3,2,19950,263,C23 C25 C27,S

In [42]:
import pandas as pd
columns = [
    'PassengerId', 'Survived', 'Pclass', 'Name',
    'Sex', 'Age', 'SibSp', 'Parch', 'Ticket', 'Fare',
    'Cabin', 'Embarked',
]
pd.read_clipboard(header=None, names=columns)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,####,Select,the,loanID,column,NaN,NaN,NaN,NaN,NaN,NaN,NaN

<p style="font-family: Arial; font-size:1.25em;color:#2462C0; font-style:bold">
Basic DataFrame operations</p>

In [43]:
print(df)

   one  two
a  1.0    2
b  2.0    4
c  3.0    6
d  NaN    7

In [44]:
#Selecting column
df['one']

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In [45]:
#selecting row
df.loc['b']

one    2.0
two    4.0
Name: b, dtype: float64

In [46]:
#selecting rows based on position
df.iloc[0]

one    1.0
two    2.0
Name: a, dtype: float64

In [47]:
#Selecting rows based on condition
df[df['two']>4]

   one  two
c  3.0    6
d  NaN    7

In [48]:
#Adding a column
df['three'] = df['one'] * df['two']
df

   one  two  three
a  1.0    2    2.0
b  2.0    4    8.0
c  3.0    6   18.0
d  NaN    7    NaN

In [49]:
#adding a flag
df['flag'] = df['one'] > 250
df

   one  two  three   flag
a  1.0    2    2.0  False
b  2.0    4    8.0  False
c  3.0    6   18.0  False
d  NaN    7    NaN  False

In [50]:
# deleting a column
del df['two']

In [51]:
df

   one  three   flag
a  1.0    2.0  False
b  2.0    8.0  False
c  3.0   18.0  False
d  NaN    NaN  False

In [52]:
df.insert(2, 'copy_of_one', df['one'])
df

   one  three  copy_of_one   flag
a  1.0    2.0          1.0  False
b  2.0    8.0          2.0  False
c  3.0   18.0          3.0  False
d  NaN    NaN          NaN  False

In [53]:
df['one_upper_half'] = df['one'][:2]
df

   one  three  copy_of_one   flag  one_upper_half
a  1.0    2.0          1.0  False             1.0
b  2.0    8.0          2.0  False             2.0
c  3.0   18.0          3.0  False             NaN
d  NaN    NaN          NaN  False             NaN

In [54]:
#Checking null values
df.isnull().any()

one                True
three              True
copy_of_one        True
flag              False
one_upper_half     True
dtype: bool

In [55]:
#Counting null values
df.isnull().sum()

one               1
three             1
copy_of_one       1
flag              0
one_upper_half    2
dtype: int64

In [56]:
#Replacing null values
df['one'].fillna(0,inplace=True)
df

   one  three  copy_of_one   flag  one_upper_half
a  1.0    2.0          1.0  False             1.0
b  2.0    8.0          2.0  False             2.0
c  3.0   18.0          3.0  False             NaN
d  0.0    NaN          NaN  False             NaN

In [57]:
df.isnull().any() #Checking null values
df.isnull().sum() #Counting null values
df['one'].fillna(0,inplace=True)#Replacing null values

### Pandas Cut functions

In [82]:
data=np.array([1, 7, 5, 4, 6, 3, 8, 9])
data

array([1, 7, 5, 4, 6, 3, 8, 9])

In [85]:
binned=pd.cut(data, 3, labels=["bad", "medium", "good"])
binned

['bad', 'good', 'medium', 'medium', 'medium', 'bad', 'good', 'good']
Categories (3, object): ['bad' < 'medium' < 'good']

In [86]:
binned.value_counts()

bad       2
medium    3
good      3
dtype: int64

### Loading data from a file

In [5]:
loanData = pd.read_csv('/Users/adamrob/data/fannie/Acquisition_2015Q1.txt', sep='|',encoding='latin1',
                           names=["loanID","channel","sellerName","origIntRate","origUPB","origLoanTerm","orig_date",
                                  "firstPaymentDate", "origLTV", "origCLTV", "numBorower", "DTI", "borrowCreditScore", "firstTimeBuyer",
                                  "loanPurpose", "propertyType", "numberOfUnit", "occupStatus", "propType", "zip","miPercentage",
                                  "prodType", "coBorrowCreditScore"])
#print(" Acquisition Data \n")
display(Markdown("**Loan Acquision Table** \n"))
print(loanData.head(5)) #first N rows
print (" \n ")

**Loan Acquision Table**

         loanID channel              sellerName  origIntRate  origUPB  \
0  100002091588       R                   OTHER        4.125   345000
1  100004219574       R  WELLS FARGO BANK, N.A.        4.125   293000
2  100004457300       C  WELLS FARGO BANK, N.A.        3.875   304000
3  100006803390       R                   OTHER        4.375   110000
4  100008763886       R      QUICKEN LOANS INC.        4.375   325000

   origLoanTerm orig_date firstPaymentDate  origLTV  origCLTV  ...  \
0           360   12/2014          02/2015       95        95  ...
1           312   12/2014          02/2015       77        77  ...
2           360   11/2014          01/2015       80        80  ...
3           360   10/2014          12/2014       65        65  ...
4           348   01/2015          03/2015       72        72  ...

   firstTimeBuyer  loanPurpose  propertyType numberOfUnit occupStatus  \
0               N            P            PU            1           P
1               N            R            PU            1           P
2               N            P            SF            1           P
3               N            C            SF            1           P
4               N            R            SF            1           P

  propType  zip miPercentage prodType  coBorrowCreditScore
0       NC  282         30.0      FRM                  NaN
1       IL  605          NaN      FRM                723.0
2       GA  300          NaN      FRM                  NaN
3       VA  229          NaN      FRM                736.0
4       CA  936          NaN      FRM                797.0

[5 rows x 23 columns]

## Excercise 1 - Read the following file into a Pandas DataFrame. Name the DataFrame as "perfData".

**File Name:** 'Performance_2015Q1_part1.csv'

**Column Names:** ["loanID","periodMonth","servicerName","currIntRate","currUPB","loanAge","monthToMature",
                                  "adjMonthToMature", "maturityDate", "MSA", "delinqStatus", "modFlag", "zeroBalCode", "loanBalEffectDate",
                                  "lastPaidInstallDate", "forecloseDate", "dispositionDate", "foreclCost", "propMaintCost", "assetRecovCost",
                                  "miscHoldingExpCredit",
                                  "taxAssociated", "netSalesProceed", "creditEnhcProceed", "repurchaseMakeWhole","otherForeclProceed","unknown1","unknown2"]


**Title of the Table:** Loan Performance Table

**Loan Performance Table**

         loanID periodMonth servicerName  currIntRate  currUPB  loanAge  \
0  100002091588  01/01/2015        OTHER        4.125      NaN        0
1  100002091588  02/01/2015          NaN        4.125      NaN        1
2  100002091588  03/01/2015          NaN        4.125      NaN        2
3  100002091588  04/01/2015          NaN        4.125      NaN        3
4  100002091588  05/01/2015          NaN        4.125      NaN        4

   monthToMature  adjMonthToMature maturityDate    MSA  ... propMaintCost  \
0            360             360.0      01/2045  16740  ...           NaN
1            359             359.0      01/2045  16740  ...           NaN
2            358             358.0      01/2045  16740  ...           NaN
3            357             357.0      01/2045  16740  ...           NaN
4            356             356.0      01/2045  16740  ...           NaN

  assetRecovCost  miscHoldingExpCredit taxAssociated  netSalesProceed  \
0            NaN                   NaN           NaN              NaN
1            NaN                   NaN           NaN              NaN
2            NaN                   NaN           NaN              NaN
3            NaN                   NaN           NaN              NaN
4            NaN                   NaN           NaN              NaN

   creditEnhcProceed  repurchaseMakeWhole  otherForeclProceed  unknown1  \
0                NaN                  NaN                 NaN       NaN
1                NaN                  NaN                 NaN       NaN
2                NaN                  NaN                 NaN       NaN
3                NaN                  NaN                 NaN       NaN
4                NaN                  NaN                 NaN       NaN

   unknown2
0       NaN
1       NaN
2       NaN
3       NaN
4       NaN

[5 rows x 28 columns]

<h1 style="font-size:1.5em;color:#2467C0">DataFrames </h1>

In [41]:
loanData.head()

,loanID,channel,sellerName,origIntRate,origUPB,origLoanTerm,orig_date,firstPaymentDate,origLTV,origCLTV,...,firstTimeBuyer,loanPurpose,propertyType,numberOfUnit,occupStatus,propType,zip,miPercentage,prodType,coBorrowCreditScore
0,100002091588,R,OTHER,4.125,345000,360,12/2014,02/2015,95,95,...,N,P,PU,1,P,NC,282,30.0,FRM,NaN
1,100004219574,R,"WELLS FARGO BANK, N.A.",4.125,293000,312,12/2014,02/2015,77,77,...,N,R,PU,1,P,IL,605,NaN,FRM,723.0
2,100004457300,C,"WELLS FARGO BANK, N.A.",3.875,304000,360,11/2014,01/2015,80,80,...,N,P,SF,1,P,GA,300,NaN,FRM,NaN
3,100006803390,R,OTHER,4.375,110000,360,10/2014,12/2014,65,65,...,N,C,SF,1,P,VA,229,NaN,FRM,736.0
4,100008763886,R,QUICKEN LOANS INC.,4.375,325000,348,01/2015,03/2015,72,72,...,N,R,SF,1,P,CA,936,NaN,FRM,797.0

In [42]:
loanData.index

RangeIndex(start=0, stop=326695, step=1)

In [43]:
loanData.columns

Index(['loanID', 'channel', 'sellerName', 'origIntRate', 'origUPB',
       'origLoanTerm', 'orig_date', 'firstPaymentDate', 'origLTV', 'origCLTV',
       'numBorower', 'DTI', 'borrowCreditScore', 'firstTimeBuyer',
       'loanPurpose', 'propertyType', 'numberOfUnit', 'occupStatus',
       'propType', 'zip', 'miPercentage', 'prodType', 'coBorrowCreditScore'],
      dtype='object')

In [44]:
# Extract row 0, 100, 1000 from DataFrame
loanData.iloc[ [0,100,1000] ]

,loanID,channel,sellerName,origIntRate,origUPB,origLoanTerm,orig_date,firstPaymentDate,origLTV,origCLTV,...,firstTimeBuyer,loanPurpose,propertyType,numberOfUnit,occupStatus,propType,zip,miPercentage,prodType,coBorrowCreditScore
0,100002091588,R,OTHER,4.125,345000,360,12/2014,02/2015,95,95,...,N,P,PU,1,P,NC,282,30.0,FRM,NaN
100,100317081765,C,"WELLS FARGO BANK, N.A.",4.375,160000,360,12/2014,02/2015,90,90,...,N,P,PU,1,S,TX,781,25.0,FRM,733.0
1000,102816334673,B,OTHER,4.250,127000,360,12/2014,02/2015,80,80,...,N,P,CO,1,S,NC,287,NaN,FRM,799.0

<h1 style="font-size:2em;color:#2467C0">Descriptive Statistics</h1>

In [58]:
# Describing a single column
loanData['origUPB'].describe()

count    3.266950e+05
mean     2.407928e+05
std      1.202889e+05
min      1.200000e+04
25%      1.470000e+05
50%      2.220000e+05
75%      3.200000e+05
max      1.203000e+06
Name: origUPB, dtype: float64

In [59]:
# Describing the whole table
loanData.describe()

,loanID,origIntRate,origUPB,origLoanTerm,origLTV,origCLTV,numBorower,DTI,borrowCreditScore,numberOfUnit,zip,miPercentage,coBorrowCreditScore
count,3.266950e+05,326695.000000,3.266950e+05,326695.000000,326695.000000,326695.000000,326695.000000,326598.000000,326577.000000,326695.000000,326695.000000,103468.000000,157147.000000
mean,5.503930e+11,4.172323,2.407928e+05,359.843582,76.884966,77.596416,1.487069,34.023647,751.836755,1.038795,601.307244,25.356622,759.128179
std,2.596103e+11,0.344801,1.202889e+05,2.168483,14.907149,14.929720,0.512742,8.656829,46.097700,0.269014,305.976799,6.525678,43.350807
min,1.000021e+11,2.750000,1.200000e+04,301.000000,3.000000,3.000000,1.000000,1.000000,471.000000,1.000000,0.000000,6.000000,490.000000
25%,3.252292e+11,3.875000,1.470000e+05,360.000000,70.000000,71.000000,1.000000,28.000000,720.000000,1.000000,327.000000,25.000000,732.000000
50%,5.510662e+11,4.125000,2.220000e+05,360.000000,80.000000,80.000000,1.000000,35.000000,762.000000,1.000000,640.000000,30.000000,770.000000
75%,7.754436e+11,4.375000,3.200000e+05,360.000000,90.000000,90.000000,2.000000,41.000000,790.000000,1.000000,907.000000,30.000000,794.000000
max,9.999957e+11,6.125000,1.203000e+06,360.000000,97.000000,105.000000,4.000000,51.000000,839.000000,4.000000,999.000000,40.000000,837.000000

In [8]:
loanData['borrowCreditScore'].mean()

751.8367551909657

In [48]:
loanData['borrowCreditScore'].min()

471.0

In [49]:
loanData['borrowCreditScore'].max()

839.0

In [50]:
loanData['borrowCreditScore'].std()

46.09769953873249

In [51]:
loanData['borrowCreditScore'].mode()

0    801.0
dtype: float64

In [52]:
loanData.corr()

,loanID,origIntRate,origUPB,origLoanTerm,origLTV,origCLTV,numBorower,DTI,borrowCreditScore,numberOfUnit,zip,miPercentage,coBorrowCreditScore
loanID,1.000000,-0.002168,-0.000944,-0.001819,0.000579,0.000335,0.001874,-0.001564,0.003674,0.000041,-0.002308,0.000819,0.001936
origIntRate,-0.002168,1.000000,-0.208986,-0.011273,0.164424,0.161094,-0.065848,0.149126,-0.388532,0.109249,-0.038613,-0.079057,-0.366862
origUPB,-0.000944,-0.208986,1.000000,-0.007772,-0.030600,-0.007717,0.166198,0.060736,0.090680,0.086089,0.160365,-0.019131,0.067285
origLoanTerm,-0.001819,-0.011273,-0.007772,1.000000,0.008183,0.008921,-0.013515,0.013625,-0.018940,0.006000,0.017326,0.027957,-0.019572
origLTV,0.000579,0.164424,-0.030600,0.008183,1.000000,0.973429,-0.043807,0.048152,-0.098579,-0.100509,-0.130198,0.767360,-0.140064
origCLTV,0.000335,0.161094,-0.007717,0.008921,0.973429,1.000000,-0.038430,0.049880,-0.104063,-0.105279,-0.127452,0.626622,-0.145683
numBorower,0.001874,-0.065848,0.166198,-0.013515,-0.043807,-0.038430,1.000000,-0.093050,0.115622,-0.002000,0.035792,0.011339,-0.004082
DTI,-0.001564,0.149126,0.060736,0.013625,0.048152,0.049880,-0.093050,1.000000,-0.181649,0.018396,0.045397,0.009280,-0.200430
borrowCreditScore,0.003674,-0.388532,0.090680,-0.018940,-0.098579,-0.104063,0.115622,-0.181649,1.000000,0.026819,0.017597,0.021233,0.680389
numberOfUnit,0.000041,0.109249,0.086089,0.006000,-0.100509,-0.105279,-0.002000,0.018396,0.026819,1.000000,-0.002966,-0.119837,0.026335
zip,-0.002308,-0.038613,0.160365,0.017326,-0.130198,-0.127452,0.035792,0.045397,0.017597,-0.002966,1.000000,-0.013030,0.008217
miPercentage,0.000819,-0.079057,-0.019131,0.027957,0.767360,0.626622,0.011339,0.009280,0.021233,-0.119837,-0.013030,1.000000,-0.009519
coBorrowCreditScore,0.001936,-0.366862,0.067285,-0.019572,-0.140064,-0.145683,-0.004082,-0.200430,0.680389,0.026335,0.008217,-0.009519,1.000000

<h1 style="font-size:2em;color:#2467C0">Merge Dataframes</h1>

In [60]:
loanAll = pd.merge(loanData, perfData, on='loanID', how='inner')

More examples: http://pandas.pydata.org/pandas-docs/stable/merging.html

In [68]:
df  = loanAll.drop(['unknown1','unknown2', 'assetRecovCost',
 'creditEnhcProceed',
 'miscHoldingExpCredit',
 'netSalesProceed',
 'otherForeclProceed',
 'periodMonth',
 'propMaintCost',
 'propType',
 'taxAssociated',
 'zeroBalCode',
 'dispositionDate',
 'repurchaseMakeWhole',
 'foreclCost',
 'forecloseDate',
 'lastPaidInstallDate',
 'loanBalEffectDate',
 'servicerName',
 'adjMonthToMature'                  
  ], axis=1)

## Excercise-2

#### a. Show the number of rows and columns in in the df table

#### b. Display the columns in descending order along with their counts

miPercentage           1154949
currUPB                 938008
coBorrowCreditScore     884891
borrowCreditScore          648
DTI                        540
modFlag                      0
channel                      0
sellerName                   0
origIntRate                  0
origUPB                      0
origLoanTerm                 0
orig_date                    0
firstPaymentDate             0
origLTV                      0
origCLTV                     0
numBorower                   0
loanPurpose                  0
firstTimeBuyer               0
delinqStatus                 0
propertyType                 0
numberOfUnit                 0
occupStatus                  0
zip                          0
prodType                     0
currIntRate                  0
loanAge                      0
monthToMature                0
maturityDate                 0
MSA                          0
loanID                       0
dtype: int64

#### c. Display the total missing values percentage of missing values for each columns as shown below

                       Total    Percent
miPercentage         1154949  67.938176
currUPB               938008  55.176941
coBorrowCreditScore   884891  52.052412
borrowCreditScore        648   0.038118
DTI                      540   0.031765
modFlag                    0   0.000000
channel                    0   0.000000
sellerName                 0   0.000000
origIntRate                0   0.000000
origUPB                    0   0.000000
origLoanTerm               0   0.000000
orig_date                  0   0.000000
firstPaymentDate           0   0.000000
origLTV                    0   0.000000
origCLTV                   0   0.000000
numBorower                 0   0.000000
loanPurpose                0   0.000000
firstTimeBuyer             0   0.000000
delinqStatus               0   0.000000
propertyType               0   0.000000
numberOfUnit               0   0.000000
occupStatus                0   0.000000
zip                        0   0.000000
prodType                   0   0.000000
currIntRate                0   0.000000
loanAge                    0   0.000000
monthToMature              0   0.000000
maturityDate               0   0.000000
MSA                        0   0.000000
loanID                     0   0.000000

Let's look at the null values

In [15]:
null_columns=df.columns[df.isnull().any()]
print(df[df.isnull().any(axis=1)][null_columns].head())

    DTI  borrowCreditScore  miPercentage  coBorrowCreditScore  currUPB
0  32.0              652.0          30.0                  NaN      NaN
1  32.0              652.0          30.0                  NaN      NaN
2  32.0              652.0          30.0                  NaN      NaN
3  32.0              652.0          30.0                  NaN      NaN
4  32.0              652.0          30.0                  NaN      NaN

#### d. Replace the null values as zero for the above columns

#### e. Select the 'sellerName' and 'delinqStatus' and show the first 7 rows

  sellerName delinqStatus
0      OTHER            0
1      OTHER            0
2      OTHER            0
3      OTHER            0
4      OTHER            0
5      OTHER            0
6      OTHER            0

#### f. Count the number of delinquent loans using the delinqStatus column and show the relults

0     1685940
X        7636
1        5417
2         563
3         190
4         103
5          62
6          41
7          26
8          14
9           7
10          1
Name: delinqStatus, dtype: int64

#### g. Filters for loanIDs where borrowers have excellent credit scores using the condition 'borrowCreditScore' >= 800. Display any 7 rows using this filter.

,loanID,channel,sellerName,origIntRate,origUPB,origLoanTerm,orig_date,firstPaymentDate,origLTV,origCLTV,...,prodType,coBorrowCreditScore,currIntRate,currUPB,loanAge,monthToMature,maturityDate,MSA,delinqStatus,modFlag
34,100004457300,C,"WELLS FARGO BANK, N.A.",3.875,304000,360,11/2014,01/2015,80,80,...,FRM,NaN,3.875,298397.66,11,349,12/2044,12060,0,N
35,100004457300,C,"WELLS FARGO BANK, N.A.",3.875,304000,360,11/2014,01/2015,80,80,...,FRM,NaN,3.875,297858.41,12,348,12/2044,12060,0,N
91,100023998128,R,OTHER,4.125,125000,360,01/2015,03/2015,61,61,...,FRM,NaN,4.125,NaN,0,360,02/2045,36100,0,N
92,100023998128,R,OTHER,4.125,125000,360,01/2015,03/2015,61,61,...,FRM,NaN,4.125,NaN,1,359,02/2045,36100,0,N
93,100023998128,R,OTHER,4.125,125000,360,01/2015,03/2015,61,61,...,FRM,NaN,4.125,NaN,2,358,02/2045,36100,0,N
94,100023998128,R,OTHER,4.125,125000,360,01/2015,03/2015,61,61,...,FRM,NaN,4.125,NaN,3,357,02/2045,36100,0,N
95,100023998128,R,OTHER,4.125,125000,360,01/2015,03/2015,61,61,...,FRM,NaN,4.125,NaN,4,356,02/2045,36100,0,N

#### h. Group by 'delinqStatus' by propertyType and display the results

              delinqStatus
propertyType
CO                   75358
CP                    3583
MH                    3317
PU                  210526
SF                  469208